[WOTC_APA_CompactBurstFireFrame X2AbilityTemplate]
LocFriendlyName = "紧凑短点射构型"
LocHelpText = "冲锋枪"
LocLongDescription = "<font color='#E1BDFF'>冲锋枪特殊武器升级：</font><br/>冲锋枪每次射击粉碎<font color='#3ABD23'><Ability:CV_SMG_ARMOR_SHRED/></font>护甲，但紧凑的设计以及小型化弹药造成了<font color='#3ABD23'>+<Ability:COMPACT_FRAME_MOBILITY/></font>移动力和<font color='#CA7200'><Ability:CV_SMG_ARMOR_PIERCE/></font>的穿甲。"

[WOTC_APA_CompactBurstFireFrame_ABW X2AbilityTemplate]
LocFriendlyName = "紧凑短点射构型"
LocHelpText = "冲锋枪"
LocLongDescription = "<font color='#E1BDFF'>冲锋枪特殊武器升级：</font><br/>特殊的紧凑构型允许射手在战场上快速机动并进行扫射。<br/>冲锋枪每次射击粉碎<font color='#3ABD23'><Ability:CV_SMG_ARMOR_SHRED/></font>护甲，但紧凑的设计以及小型化弹药造成了<font color='#3ABD23'>+<Ability:COMPACT_FRAME_MOBILITY/></font>移动力和<font color='#CA7200'><Ability:CV_SMG_ARMOR_PIERCE/></font>的穿甲。"

[SMG_CV X2WeaponTemplate]
FriendlyName="冲锋枪"
FriendlyNamePlural="冲锋枪"
BriefSummary="冲锋枪相对于突击步枪提供了更轻，更隐蔽的选择，虽然他们威力一般并且在远距离精度也较差。"
TacticalText="<Bullet/>在未进行特殊训练前，用主武器射击会结束该士兵的回合。\n<Bullet/>使用从变种人敌人那收集的升级来提升冲锋枪的武器效能。\n<Bullet/>冲锋枪风格的武器相比突击步枪能提供额外的移动力，近战精度和隐蔽性，但他们伤害更低，弹夹更小，并在远距离受到精度减益。"
AbilityDescName="冲锋枪"

[SMG_MG X2WeaponTemplate]
FriendlyName="斯塔特磁力枪"
FriendlyNamePlural="斯塔特磁力枪"
BriefSummary="斯塔特磁力枪是磁力步枪的轻量版，扮演着和冲锋枪类似的角色，以威力，弹药和远距离精度为代价，给士兵提供机动性和隐蔽性。"
TacticalText="<Bullet/>在未进行特殊训练前，用主武器射击会结束该士兵的回合。\n<Bullet/>使用从变种人敌人那收集的升级来提升斯塔特磁力枪的武器效能。\n<Bullet/>冲锋枪风格的武器相比突击步枪能提供额外的移动力，近战精度和隐蔽性，但他们伤害更低，弹夹更小，并在远距离受到精度减益。"
AbilityDescName="冲锋枪"

[SMG_BM X2WeaponTemplate]
FriendlyName="斯卡拉姆枪"
FriendlyNamePlural="斯卡拉姆枪"
BriefSummary="斯卡拉姆枪，跟冲锋枪和斯塔特磁力枪一样，是一种更小型的主武器，能够提供移动力和隐蔽性的加成，但伤害更低并在远距离受到精度减益。不过，它依然是一种有相当威力的个人武器。"
TacticalText="<Bullet/> 用主武器射击会结束该士兵的回合\n<Bullet/>使用从变种人敌人那收集的升级来提升斯卡拉姆枪的武器效能。\n<Bullet/>冲锋枪风格的武器相比突击步枪能提供额外的移动力，近战精度和隐蔽性，但他们伤害更低，弹夹更小，并在远距离受到精度减益。"
AbilityDescName="冲锋枪"

[Vee_SMG_CV X2WeaponTemplate]
FriendlyName="冲锋枪"
FriendlyNamePlural="冲锋枪"
BriefSummary="冲锋枪相对于突击步枪提供了更轻，更隐蔽的选择，虽然他们威力一般并且在远距离精度也较差。"
TacticalText="<Bullet/>在未进行特殊训练前，用主武器射击会结束该士兵的回合。\n<Bullet/>使用从变种人敌人那收集的升级来提升冲锋枪的武器效能。\n<Bullet/>冲锋枪风格的武器相比突击步枪能提供额外的移动力，近战精度和隐蔽性，但他们伤害更低，弹夹更小，并在远距离受到精度减益。"
AbilityDescName="冲锋枪"

[Vee_SMG_MG X2WeaponTemplate]
FriendlyName="斯塔特磁力枪"
FriendlyNamePlural="斯塔特磁力枪"
BriefSummary="斯塔特磁力枪是磁力步枪的轻量版，扮演着和冲锋枪类似的角色，以威力，弹药和远距离精度为代价，给士兵提供机动性和隐蔽性。"
TacticalText="<Bullet/>在未进行特殊训练前，用主武器射击会结束该士兵的回合。\n<Bullet/>使用从变种人敌人那收集的升级来提升斯塔特磁力枪的武器效能。\n<Bullet/>冲锋枪风格的武器相比突击步枪能提供额外的移动力，近战精度和隐蔽性，但他们伤害更低，弹夹更小，并在远距离受到精度减益。"
AbilityDescName="冲锋枪"

[Vee_SMG_BM X2WeaponTemplate]
FriendlyName="斯卡拉姆枪"
FriendlyNamePlural="斯卡拉姆枪"
BriefSummary="斯卡拉姆枪，跟冲锋枪和斯塔特磁力枪一样，是一种更小型的主武器，能够提供移动力和隐蔽性的加成，但伤害更低并在远距离受到精度减益。不过，它依然是一种有相当威力的个人武器。"
TacticalText="<Bullet/> 用主武器射击会结束该士兵的回合\n<Bullet/>使用从变种人敌人那收集的升级来提升斯卡拉姆枪的武器效能。\n<Bullet/>冲锋枪风格的武器相比突击步枪能提供额外的移动力，近战精度和隐蔽性，但他们伤害更低，弹夹更小，并在远距离受到精度减益。"
AbilityDescName="冲锋枪"